FV2610/E_1001.puml
@startuml
skinparam Shadowing false
skinparam NoteBorderColor #f3f1f6
skinparam NoteBackgroundColor #f3f1f6
skinparam NoteFontSize 12
skinparam ActivityBorderColor none
skinparam ActivityBackgroundColor #7a8da1
skinparam ActivityFontSize 16
skinparam ArrowColor #7aab8a
skinparam ArrowFontSize 16
skinparam ActivityDiamondBackgroundColor #7aab8a
skinparam ActivityDiamondBorderColor #7aab8a
skinparam ActivityDiamondFontSize 18
skinparam defaultFontName DejaVu Serif Condensed
skinparam ActivityEndColor #669580

header
<b>FV2210
2022-12-12
endheader

footer
v4.3 | 23.06.2026 (urspr. 01.04.2026) | ebdamame v1.0.0 | rebdhuhn v1.2.0
endfooter

title
Sperrprozesse Gas

17.2.2: AD: Unterbrechung der Anschlussnutzung (Sperren) auf Anweisung des LF



end title
:<b>E_1001</b>;
note right
<b><i>Prüfende Rolle: MSB
end note

if (<b>10: </b> Hat der MSB die generelle Zustimmung zur Durchführung einer Entsperrung/Sperrung dem NB erteilt?) then (ja)
    :A01;
    note left
        Cluster: Zustimmung
        Generelle Zustimmung des MSB für die Sperrung/Entsperrung liegt vor.
    endnote
    kill;
else (nein)
endif
if (<b>20: </b> Liegt ein Verhinderungsgrund einer Sperrung an der Marktlokation vor?) then (ja)
    :A02;
    note left
        Cluster: Ablehnung
        Verhinderungsgrund liegt vor.
        Hinweis: Das identifizierte Problem ist in der
         Antwort zu beschreiben/benennen.
    endnote
    kill;
else (nein)
endif
if (<b>30: </b> Liegen dem MSB technische Gründe für eine Ablehnung der Sperrung vor?) then (ja)
    :A03;
    note left
        Cluster: Ablehnung
        Es liegt ein technischer Ablehnungsgrund vor.
        Hinweis: Das identifizierte Problem ist in der
         Antwort zu beschreiben/benennen.
    endnote
    kill;
else (nein)
endif
if (<b>40: </b> Ist eine Mitwirkung des MSB bei Entsperrung/Sperrung vor Ort gewünscht?) then (ja)
    :A04;
    note left
        Cluster: Zustimmung
        MSB hat Durchführung der Sperrung und Entsperrung unter Mitwirkung des MSB zugestimmt.
    endnote
    kill;
else (nein)
    :A05;
    note left
        Cluster: Zustimmung
        MSB hat Durchführung der Sperrung und Entsperrung durch NB zugestimmt.
    endnote
    kill;
endif

@enduml
